Repository: nesirid/UserAuth
Catalog: SharedLibrary/Resources/Messages.*.resx
Languages: ru

# ALL_LANGUAGES_REQUIRED
source: It should be added in 3 languages ​​as well
ru: Должен быть добавлен на 3 языках

# APPLICATION_ALREADY_EXIST
source: Applications for this vacancy are now available.
ru: Заявка на данную вакансию уже доступна

# APPLICATION_IS_DEACTIVE
source: This application is inactive.
ru: Это приложение отключено

source: Authentication failed
ru: Ошибка аутентификации

# BIRTHDAY_MUST_BE_IN_THE_PAST
source: Birthday date must be in the past
ru: День рождения должен быть в прошлом

source: Cannot be empty
ru: Не может быть пустым

# CANNOT_CHANGE_PENDING_STATUS
source: You cannot hide the pending status.
ru: Невозможно скрыть ожидаемый статус.

# CANNOT_CHANGE_STATUS
source: Status cannot be changed.
ru: Статус не может быть изменен

# DESCRIPTION_MUST_NOT_EXCEED_4096_CHAR
source: Intro description must not exceed 4096 characters.
ru: Длина вводного описания не должна превышать 4096 символов.

source: Duration must be greater than zero.
ru: Длительность должна быть больше нуля.

# EMAIL_ALREADY_USED
source: This email is used by another company.
ru: Этот адрес электронной почты используется другой компанией.

# END_DATE_MUST_BE
source: End Date must be provided if the education is not current
ru: Необходимо указать дату окончания, если образование не актуально.

# END_DATE_MUST_NOT_BE_IN_THE_PAST
source: The end time cannot be in the past.
ru: Срок годности не может быть в прошлом

# EXAM_ALREADY_TAKEN
source: You have already taken this exam.
ru: Вы уже сдавали этот экзамен.

# FILE_SIZE_MAX_20MB
source: File size must not exceed 20 MB.
ru: Размер файла не должен превышать 20 МБ.

# GREATER_THAN_OR_EQUAL_TO_ZERO
source: Number must be greater than or equal to 0
ru: Число должно быть больше или равно 0

# INSUFFICIENT_BALANCE
source: You do not have enough balance to complete the transaction.
ru: У вас недостаточно средств для завершения транзакции.

source: Invalid format
ru: Неверный формат

# INVALID_USER_STATUS
source: The provided user status is invalid
ru: Указанный статус пользователя недействителен

# LENGTH_MUST_BE_BETWEEN_1_100
source: Length must be between 1 and 100
ru: Длина должна быть от 1 до 100

# LENGTH_MUST_BE_BETWEEN_1_1000
source: Length must be between 1 and 1000
ru: Длина должна быть от 1 до 1000

# LENGTH_MUST_BE_BETWEEN_1_200
source: Length must be between 1 and 200
ru: Длина должна быть от 1 до 200

# LENGTH_MUST_BE_BETWEEN_1_50
source: Length must be between 1 and 50
ru: Длина должна быть от 1 до 50

# LENGTH_MUST_BE_BETWEEN_1_500
source: Length must be between 1 and 500
ru: Длина должна быть от 1 до 500

# LENGTH_MUST_BE_BETWEEN_1_8192
source: Length must be between 1 and 8192
ru: Длина должна быть от 1 до 8192

# LIMIT_RATE_MUST_BE_BETWEEN_0_100
source: The minimum score for passing the exam must be between 0 - 100
ru: Минимальный балл для сдачи экзамена должен быть от 0 до 100.

# LOGIN_REQUIRED
source: Please log in again to continue
ru: Пожалуйста, войдите снова, чтобы продолжить

# MAIN_SALARY
source: Main salary cannot exceed the maximum salary
ru: Основная зарплата не может превышать максимальную зарплату

# NOTFOUNDEXCEPTION_USER
source: User does not exist
ru: Пользователь не существует

# NOT_EMPTY
source: It should not be empty
ru: Он не должен быть пустым

source: Not found
ru: Не найдено

# NO_PERMISSION
source: You have no permission
ru: У вас нет разрешения

# OLD_PASSWORD_WRONG
source: The old password is incorrect
ru: Старый пароль неверный

source: Passwords do not match
ru: Пароли не совпадают

# PASSWORD_LENGTH_RANGE
source: Length must be between 8 and 100 characters
ru: Длина должна быть от 8 до 100 символов

# PASSWORD_MIN_LENGTH
source: Password must be at least 8 characters long
ru: Пароль должен содержать минимум 8 символов

# PASSWORD_MUST_CONTAIN_LOWERCASE
source: Password must contain at least one lowercase letter
ru: Пароль должен содержать хотя бы одну строчную букву

# PASSWORD_MUST_CONTAIN_NUMBER
source: Password must contain at least one number
ru: Пароль должен содержать хотя бы одну цифру

# PASSWORD_MUST_CONTAIN_SPECIAL_CHAR
source: Password must contain at least one special character
ru: Пароль должен содержать хотя бы один специальный символ

# PASSWORD_MUST_CONTAIN_UPPERCASE
source: Password must contain at least one uppercase letter
ru: Пароль должен содержать хотя бы одну заглавную букву

# REGISTER_COMPLETED
source: Registration completed successfully
ru: Регистрация успешно завершена

# RESUME_ACCESS_ALREADY_EXIST
source: You already have permission to view this resume.
ru: У вас уже есть разрешение на просмотр этого резюме.

# RESUME_IS_PUBLIC
source: This resume is not anonymous.
ru: Это резюме не анонимно.

# SESSION_EXPIRED
source: Your session has expired
ru: Время вашей сессии истекло

# STARTDATE_MUST_BE_EARLIER_ENDATE
source: Start time must be before end time
ru: Время начала должно быть раньше времени окончания.

# START_DATE_CANNOT_BE_IN_THE_FUTURE
source: The start time cannot be in the future
ru: Время начала не может быть в будущем

# STATUS_PERMISSION
source: You do not have permission to delete status.
ru: Вам не разрешено удалять статус

# TERMS_NOT_ACCEPTED
source: You cannot register without accepting the terms
ru: Вы не можете зарегистрироваться без согласия с условиями

# UNAUTHORIZED_ACCESS
source: You do not have permission.
ru: У вас нет разрешения.

# USEREXISTEXCEPTION_EMAIL
source: Email already exists
ru: Электронная почта уже существует

# USEREXISTEXCEPTION_PHONE
source: Phone number already exists
ru: Номер уже существует

# USER_PHONE_OR_EMAIL_EXISTS
source: User phone number or email already exists
ru: Номер пользователя или email уже существует

# VACANCY_PAUSED
source: The vacancy status is 'Pause' and cannot be used to accept new applications.
ru: Статус вакансии — «Пауза», и она не может быть использована для приема новых заявок.

# VACANCY_STATUS_NOT_TOGGABLE
source: The status of this vacancy cannot be changed. This feature is only available for vacancies with the status "Active" or "Pause".
ru: Статус этой вакансии не может быть изменен. Данная функция доступна только для вакансий со статусом «Активно» или «Пауза».

# VACANCY_UPDATE
source: The vacancy cannot be updated because it is blocked.
ru: Вакансия не может быть обновлена, так как она заблокирована

source: Welcome
ru: Добро пожаловать
